%=========================================================================%
%  Кофигурационный файл                                                   %
%=========================================================================%

% координаты точки
%lon = 148.0333333333;
%lat = 58.31215;
lon = 141.585593;
lat = 55.161955;

% рабочая директория
workDir = '';

% индексы начала/конца выбоки данных
initfileIDX = 150;
endFileIDX = 0;


% путь к данным модели
dataPath = 'e:/Рома/Диплом/ROMS/DATA/26.04/';

%
% Запись лога
%   1: вести запись лога
%   0: не вести запись лога
%

log = 1;
logObs = 1;
logPath = 'E:\zetalog.txt';
logObsPath = 'E:\obslog.txt';

% Вывод графиков 
% 1: только данные модели
% 2: только данные наблюдений
% 3: модель и наблюдения
% 4: модель и наблюдения с синхронизацией
% 0: не выводить графики

plotData = 4;

% данные наблюдений
ofile = 'magadanData.txt';
odir = 'e:\Рома\Диплом\ROMS\OB_DATA\';
[ozeta, odates] = getObservData([odir, ofile]);
